# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
anchors: 3

# elan backbone
backbone:
  # [from, repeats, module, args]
  [
   [-1, 1, Silence, []],

   # conv down
   [-1, 1, MobileInit, []],  # 1

   # bottleneck
   [-1, 1, MobileBlock, [32, 16, 1, 1, 1]],
   [-1, 1, MobileBlock, [16, 24, 6, 2, 2]],
   [-1, 1, MobileBlock, [24, 32, 6, 3, 2]],
   [-1, 1, MobileBlock, [32, 64, 6, 4, 2]],
   [-1, 1, MobileBlock, [64, 96, 6, 3, 1]],
   [-1, 1, MobileBlock, [96, 160, 6, 3, 2]],
   [-1, 1, MobileBlock, [160, 320, 6, 1, 1]],

   [-1, 1, MobileEnd, [320, 1280]],
  ]

# elan head
head:
  [

  ]
